app/controllers/checkins_controller.rb

SELECT "checkins".* FROM "checkins" WHERE "checkins"."user_sid" = ? ORDER BY week asc  [["user_sid", "25573775"]]
SELECT  "users".* FROM "users" WHERE "users"."sid" = ? LIMIT ?  [["sid", 25573775], ["LIMIT", 1]]
SELECT "checkins".* FROM "checkins" WHERE "checkins"."user_id" = ? ORDER BY week asc  [["user_id", "4"]]
---
  def index
    if params[:user_sid]
      @checkins = Checkin.where(user_sid: params[:user_sid]).order('week asc')
      begin
        @user = User.find(params[:user_sid])
      rescue ActiveRecord::RecordNotFound => e
        puts "im here....."
        flash[:error] = "Invalid SID"
        redirect_to '/my_checkins'
        # User.first.errors.add(e)
      end
    else
      @checkins = Checkin.all.order('week asc')

INSERT INTO "checkins" ("week", "user_id", "buddy_id", "is_mirror", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["week", 2], ["user_id", "3"], ["buddy_id", "1"], ["is_mirror", "t"], ["created_at", "2017-07-09 20:08:50.724802"], ["updated_at", "2017-07-09 20:08:50.724802"]]
---
  def create
    @checkin = Checkin.new(checkin_params)
    respond_to do |format|
      if @checkin.save

DELETE FROM "checkins" WHERE "checkins"."id" = ?  [["id", 9]]
---
  def destroy
    @checkin.destroy

SELECT  "checkins".* FROM "checkins" WHERE "checkins"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
---
  def set_checkin
    @checkin = Checkin.find(params[:id])