app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("sid", "name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["sid", 25573779], ["name", "chriss"], ["email", "chriss@berkeley.edu"], ["created_at", "2017-07-09 22:52:05.427540"], ["updated_at", "2017-07-09 22:52:05.427540"]]

  def destroy
    @user.destroy
---
DELETE FROM "users" WHERE "users"."sid" = ?  [["sid", 3]]

    def set_user
      @user = User.find(params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."sid" = ? LIMIT ?  [["sid", 25573779], ["LIMIT", 1]]